In [1]:
import pandas as pd

base = pd.read_csv("BD/movies.csv")
base = base.reset_index()
base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9515 entries, 0 to 9514
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            9515 non-null   int64
 1   Unnamed: 0       9515 non-null   int64
 2   ID               9515 non-null   int64
 3   Title            9515 non-null   object
 4   Year             9515 non-null   int64
 5   Age              5338 non-null   object
 6   Rotten Tomatoes  9508 non-null   object
 7   Netflix          9515 non-null   int64
 8   Hulu             9515 non-null   int64
 9   Prime Video      9515 non-null   int64
 10  Disney+          9515 non-null   int64
 11  Type             9515 non-null   int64
dtypes: int64(9), object(3)
memory usage: 892.2+ KB

In [17]:
base.head()

,index,Unnamed: 0,ID,Title,Year,Age,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Type
0,0,0,1,The Irishman,2019,18+,98/100,1,0,0,0,0
1,1,1,2,Dangal,2016,7+,97/100,1,0,0,0,0
2,2,2,3,David Attenborough: A Life on Our Planet,2020,7+,95/100,1,0,0,0,0
3,3,3,4,Lagaan: Once Upon a Time in India,2001,7+,94/100,1,0,0,0,0
4,4,4,5,Roma,2018,18+,94/100,1,0,0,0,0

## Análisis de la data

In [18]:
cantidad_year = base.groupby(by = 'Year').count()[['ID']].reset_index()
cantidad_year.columns=['Year','Amount']
cantidad_year

     Year  Amount
0    1914       1
1    1915       2
2    1916       1
3    1919       1
4    1920       2
..    ...     ...
98   2017     831
99   2018     945
100  2019    1014
101  2020     862
102  2021     327

[103 rows x 2 columns]

In [36]:
year = 2021
base_filtrada_year=base[base['Year']==year]

cantidad_year = base.groupby(by = 'Age').count()[['ID']].reset_index()
cantidad_year.columns=['Age','Amount']
cantidad_year
# base_filtrada_year

   Age  Amount
0  13+     998
1  16+     276
2  18+    2276
3   7+    1090
4  all     698

In [33]:
def select_characters(n):
    try:
        return n[:2]
    except:
        print(n)
        return 0

# Método 1: Puede tener errores con pelis que tengan 100/100
base['Ranking'] = base['Rotten Tomatoes'].apply(select_characters).astype(int)
base.info()

# Método 2: Utilizando el método split
base['Ranking'] = base['Rotten Tomatoes'].str.split('/',expand=True)[0].fillna(0).astype(int)

year = 2021
base_filtrada_year=base[base['Year']==year]

base.sort_values(by='Ranking', ascending=False)[:10][['Title','Age']].reset_index(drop = True)

nan
nan
nan
nan
nan
nan
nan
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9515 entries, 0 to 9514
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            9515 non-null   int64
 1   Unnamed: 0       9515 non-null   int64
 2   ID               9515 non-null   int64
 3   Title            9515 non-null   object
 4   Year             9515 non-null   int64
 5   Age              5338 non-null   object
 6   Rotten Tomatoes  9508 non-null   object
 7   Netflix          9515 non-null   int64
 8   Hulu             9515 non-null   int64
 9   Prime Video      9515 non-null   int64
 10  Disney+          9515 non-null   int64
 11  Type             9515 non-null   int64
 12  Ranking          9515 non-null   int32
dtypes: int32(1), int64(9), object(3)
memory usage: 929.3+ KB

                                      Title  Age
0                              The Irishman  18+
1                                    Dangal   7+
2                              Mary Poppins  all
3  David Attenborough: A Life on Our Planet   7+
4                           The Dark Knight  13+
5         Lagaan: Once Upon a Time in India   7+
6                                      Roma  18+
7         To All the Boys I've Loved Before  13+
8                        The Social Dilemma  13+
9                                   Tumbbad  NaN

In [40]:
year = 1980
base_filtrada_year=base[base['Year']==year]

base_filtrada_year[['Netflix','Hulu','Prime Video','Disney+']].sum()

Netflix         4
Hulu            2
Prime Video    16
Disney+         4
dtype: int64